000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. "HELLOWORLD".
000003 AUTHOR.     WYATT SHANAHAN.
000004* COBOL COMMENTS WITH ASTERISK
000005 ENVIRONMENT DIVISION.
000006
000007 DATA DIVISION.
000008
000009 PROCEDURE DIVISION. 
000010 0100-START-HERE.
000011       DISPLAY "Hello, World!".
000012 STOP RUN.
000013 END PROGRAM HELLOWORLD.
